In [ ]:
## \#14: Menggabungkan (merge) dua Data Frame

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  18  14   8  10  16
1   3  13   3  15   6
2  16   7  13   7  16
3  11   6  16   6  19
4  16  16  15   4  19

In [5]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

    A   B   C   D   E
0  18  14   8  10  16
2  16   7  13   7  16
3  11   6  16   6  19

In [7]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

    A   B   C   D   E
1   3  13   3  15   6
2  16   7  13   7  16
4  16  16  15   4  19

In [ ]:
### Menggabungkan dua Data Frame

In [9]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A  B   C  D   E
0  16  7  13  7  16

In [11]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   3  13   3  15   6
1  11   6  16   6  19
2  16   7  13   7  16
3  16  16  15   4  19
4  18  14   8  10  16